RiviaRammer/M5DOOM/src/Tab5DOOM/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# Match the Tab5 reference project's PSRAM clock. IDF 5.5.1 gates 200 MHz
# behind experimental features; keep the boot memory test enabled.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_SPEED_80M is not set
# CONFIG_SPIRAM_SPEED_20M is not set
CONFIG_SPIRAM_MEMTEST=y
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_64B=y
CONFIG_HW_M5STACK_TAB5=y
# CONFIG_HW_WROVERKIT_V1 is not set
# CONFIG_HW_WROVERKIT_V2 is not set
# CONFIG_HW_CUSTOM is not set
# CONFIG_HW_PSX_ENA is not set
CONFIG_HW_TAB5_TOUCH_ENA=y
# CPU-only comparison: keep LCD double buffering and timing unchanged.
# CONFIG_HW_TAB5_PPA_ENA is not set
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set
